POPULAR_CITIES = [
    "Симферополь",
    "Севастополь",
    "Ялта",
    "Керчь",
    "Евпатория",
    "Феодосия",
]


ALL_CITIES = [

    # Крупные города

    "Симферополь",

    "Севастополь",

    "Ялта",

    "Керчь",

    "Евпатория",

    "Феодосия",

    "Джанкой",

    "Алушта",

    "Бахчисарай",

    "Белогорск",

    "Саки",

    "Судак",

    "Армянск",

    "Красноперекопск",

    # Симферопольский район

    "Николаевка",

    "Новофёдоровка",

    "Молодёжное",

    "Гвардейское",

    "Школьное",

    "Доброе",

    "Перевальное",

    "Зуя",

    "Укромное",

    # Южный берег

    "Гурзуф",

    "Партенит",

    "Кореиз",

    "Мисхор",

    "Ливадия",

    "Форос",

    "Симеиз",

    "Кацивели",

    "Ореанда",

    # Восток Крыма

    "Коктебель",

    "Орджоникидзе",

    "Новый Свет",

    "Приморский",

    "Береговое",

    "Кировское",

    "Ленино",

    "Щёлкино",

    # Западный Крым

    "Черноморское",

    "Раздольное",

    "Мирный",

    "Оленевка",

    "Межводное",

    "Заозёрное",

    "Витино",

    "Штормовое",

    # Север Крыма

    "Красногвардейское",

    "Первомайское",

    "Советский",

    "Нижнегорский",

    "Азовское",

    # Евпатория и рядом

    "Молочное",

    "Поповка",

    "Солнечная Долина",

    "Стерегущее",

]

def search_city(text):

    text = text.lower().strip()

    results = []

    for city in ALL_CITIES:

        if text in city.lower():

            results.append(city)

    return results[:5]
