POPULAR_CITIES = [
    "Симферополь",
    "Севастополь",
    "Ялта",
    "Керчь",
    "Евпатория",
    "Феодосия",
]


ALL_CITIES = [

    "Симферополь",
    "Севастополь",
    "Ялта",
    "Керчь",
    "Евпатория",
    "Феодосия",
    "Джанкой",

    "Алушта",
    "Бахчисарай",
    "Белогорск",
    "Саки",
    "Судак",
    "Щёлкино",
    "Армянск",
    "Красноперекопск",
    "Черноморское",
    "Раздольное",
    "Николаевка",
    "Гурзуф",
    "Коктебель",

]
def search_city(text):

    text = text.lower().strip()

    results = []

    for city in ALL_CITIES:

        if text in city.lower():

            results.append(city)

    return results[:5]
